'use strict';

angular.module('starter.services', [])

.service('$idcard', function($window) {
	var vcity = {
		11:'北京',12:'天津',13:'河北',14:'山西',15:'内蒙古',
		21:'辽宁',22:'吉林',23:'黑龙江',31:'上海',32:'江苏',
		33:'浙江',34:'安徽',35:'福建',36:'江西',37:'山东',41:'河南',
		42:'湖北',43:'湖南',44:'广东',45:'广西',46:'海南',50:'重庆',
		51:'四川',52:'贵州',53:'云南',54:'西藏',61:'陕西',62:'甘肃',
		63:'青海',64:'宁夏',65:'新疆',71:'台湾',81:'香港',82:'澳门',91:'国外'
	};


	//检查号码是否符合规范，包括长度，类型
	var isCardNo = function(card) {
    //身份证号码为15位或者18位，15位时全为数字，18位前17位为数字，最后一位是校验位，可能为数字或字符X
    var reg = /(^\d{15}$)|(^\d{17}(\d|X)$)/;
    if(reg.test(card) === false)
      return false;
    return true;
	};

	//取身份证前两位,校验省份
	var checkProvince = function(card) {
    var province = card.substr(0,2);
    if(!vcity[province])
      return false;
    return true;
	};

  //校验日期
  var verifyBirthday = function(year,month,day,birthday) {
    var now = new Date();
    var now_year = now.getFullYear();
    //年月日是否合理
    if(birthday.getFullYear() === parseInt(year) && (birthday.getMonth() + 1) === parseInt(month) && birthday.getDate() === parseInt(day)) {
      //判断年份的范围（3岁到100岁之间)
      var time = now_year - year;
      if(time >= 3 && time <= 100)
        return true;
      return false;
    }
    return false;
  };

	//检查生日是否正确
	var checkBirthday = function(card) {
    var len = card.length;
    var arr_data, year, month, day, birthday;

    //身份证15位时，次序为省（3位）市（3位）年（2位）月（2位）日（2位）校验位（3位），皆为数字
    if(len === 15) {
      var re_fifteen = /^(\d{6})(\d{2})(\d{2})(\d{2})(\d{3})$/;
      arr_data = card.match(re_fifteen);
      year = arr_data[2];
      month = arr_data[3];
      day = arr_data[4];
      birthday = new Date('19' + year + '/' + month + '/' + day);
      return verifyBirthday('19' + year,month,day,birthday);
    }
    //身份证18位时，次序为省（3位）市（3位）年（4位）月（2位）日（2位）校验位（4位），校验位末尾可能为X
    if(len === 18) {
      var re_eighteen = /^(\d{6})(\d{4})(\d{2})(\d{2})(\d{3})([0-9]|X)$/;
      arr_data = card.match(re_eighteen);
      year = arr_data[2];
      month = arr_data[3];
      day = arr_data[4];
      birthday = new Date(year + '/' + month + '/' + day);
      return verifyBirthday(year,month,day,birthday);
    }
    return false;
	};

  //15位转18位身份证号
  var changeFivteenToEighteen = function(card)
  {
    if(card.length === 15)
    {
      var arrInt = [7, 9, 10, 5, 8, 4, 2, 1, 6, 3, 7, 9, 10, 5, 8, 4, 2];
      var arrCh = ['1', '0', 'X', '9', '8', '7', '6', '5', '4', '3', '2'];
      var cardTemp = 0, i;
      card = card.substr(0, 6) + '19' + card.substr(6, card.length - 6);
      for(i = 0; i < 17; i++) {
        cardTemp += card.substr(i, 1) * arrInt[i];
      }
      card += arrCh[cardTemp % 11];
      return card;
    }
    return card;
  };

  //校验位的检测
	var checkParity = function(card) {
    //15位转18位
    card = changeFivteenToEighteen(card);
    var len = card.length;
    if(len === 18) {
      var arrInt = [7, 9, 10, 5, 8, 4, 2, 1, 6, 3, 7, 9, 10, 5, 8, 4, 2];
      var arrCh = ['1', '0', 'X', '9', '8', '7', '6', '5', '4', '3', '2'];
      var cardTemp = 0, i, valnum;
      for(i = 0; i < 17; i++) {
        cardTemp += card.substr(i, 1) * arrInt[i];
      }
      valnum = arrCh[cardTemp % 11];
      if (valnum === card.substr(17, 1)) {
        return true;
      }
      return false;
    }
    return false;
	};

	//性别
	var checkGender = function(card) {
		card = changeFivteenToEighteen(card);
		var len = card.length;
		if(len === 18) {
			var sexBit = card.charAt(16);
			if(sexBit % 2 === 0){
				return '女性';
			} else {
				return '男性';
			}

		}
		return undefined;
	};

	var idCardCheck = function(card) {
    //是否为空
    if(card === '') {
      return false;
    }
    //校验长度，类型
    if(isCardNo(card) === false) {
      return false;
    }
    //检查省份
    if(checkProvince(card) === false) {
      return false;
    }
    //校验生日
    if(checkBirthday(card) === false) {
      return false;
    }
    //检验位的检测
    if(checkParity(card) === false) {
      return false;
    }
    return true;
    };

	return {
    idCardCheck: function(card) {
      return idCardCheck(card);
    },
    idCardGender: function(card) {
      if(idCardCheck(card)) {
        return checkGender(card);
      }
      return undefined;
    }
	};
})

.service('$bases', function() {

	var cardTypes = [
		'漂亮妈妈信用卡','QQ联名IC信用卡'
	];

	var maritalStatuses = [
		'未婚','已婚有子女','已婚无子女','其他'
	];

	var propertyStatuses = [
		'自购无贷款房','自购有贷款房','父母同住','租用','其他'
	];

	return {
		allCardTypes: function() {
			return cardTypes;
		},
		allMaritalStatuses: function() {
			return maritalStatuses;
		},
		allPropertyStatuses: function() {
			return propertyStatuses;
		}
	};
})

.service('$contacts', function() {

	var rels = [
		'配偶','亲属','朋友','其他'
	];

	var genders = [
		'男性','女性'
	];
	return {
		allRels: function() {
			return rels;
		},
		allGenders: function() {
			return genders;
		}
	};
})
.service('$networks', function() {

  var nets = [{d:'滨江区',c:[{c:'0453',n:'(滨安路) 滨江高新支行',a:'杭州市滨江区滨安路1228号'},{c:'0459',n:'(滨盛路) 滨江滨盛路支行',a:'杭州市滨江区滨盛路2290.2292号'},{c:'0455',n:'(滨文路) 滨江长河支行',a:'杭州市滨江区滨文路121号'},{c:'0452',n:'(东冠路) 滨江浦沿支行',a:'杭州市滨江区浦沿街道东冠路692号'},{c:'0457',n:'(东信大道) 滨江六和支行',a:'滨江区东信大道150号'},{c:'0454',n:'(固陵路) 滨江西兴支行',a:'杭州市滨江区西兴街道固陵路62号'},{c:'0458',n:'(火炬大道) 滨江江南支行',a:'杭州市滨江区浦沿街道火炬大道725号'},{c:'0451',n:'(江南大道) 滨江支行营业中心',a:'杭州市滨江区江南大道288号'},{c:'0460',n:'(月明路) 滨江月明路支行',a:'杭州市滨江区月明路新州花苑29幢'}]},{d:'淳安县',c:[{c:'0753',n:'(汾口镇) 淳安汾口支行',a:'杭州市淳安县汾口镇杨翠路25号'},{c:'0754',n:'(威坪镇) 淳安威坪支行',a:'杭州市淳安县威坪镇兴华街20号'},{c:'0758',n:'(新安大街) 淳安城关支行',a:'杭州市淳安县千岛湖镇新安大街20-27号'},{c:'0752',n:'(新安大街) 淳安支行营业中心',a:'淳安县千岛湖镇新安大街90号'},{c:'0759',n:'(新安东路) 淳安千岛湖支行',a:'杭州市淳安县千岛湖镇新安东路426、426-1、426-2号'}]},{d:'富阳市',c:[{c:'0607',n:'(场口镇) 富阳场口支行',a:'杭州市富阳市场口镇新街1号'},{c:'0603',n:'(春秋南路) 富阳青云支行',a:'杭州市富阳市春秋南路6-2'},{c:'0606',n:'(大源镇) 富阳大源支行',a:'杭州市富阳市大源镇经纬路22号'},{c:'0602',n:'(桂花路) 富阳桂花路支行',a:'富阳市富春街道桂花路43号'},{c:'0611',n:'(桂花西路) 富阳新兴支行',a:'杭州市富阳市桂花西路56号'},{c:'0618',n:'(横凉亭路) 富阳富春支行',a:'杭州市富阳市横凉亭路11号'},{c:'0604',n:'(江滨西大道) 富阳江滨支行',a:'杭州市富阳市江滨西大道9-1'},{c:'0608',n:'(万市镇) 富阳龙羊支行',a:'杭州市富阳市万市镇万市路18号'},{c:'0605',n:'(新登镇) 富阳新登支行',a:'杭州市富阳市新登镇新兴路37号'},{c:'0601',n:'(迎宾路) 富阳支行营业中心',a:'富阳市富春街道迎宾路80号'}]},{d:'拱墅区',c:[{c:'0103',n:'(半山路) 半山支行营业中心',a:'拱墅区半山路119号（杭钢南苑）'},{c:'0105',n:'(大关苑路) 之江大关支行',a:'杭州市拱墅区大关苑路55号'},{c:'0158',n:'(东新路) 之江石桥支行',a:'杭州市拱墅区东新路696号（新）'},{c:'0112',n:'(拱康路) 半山康华支行',a:'杭州市拱墅区拱康路100号康华大厦1楼'},{c:'0102',n:'(和睦路) 之江和睦支行',a:'杭州市拱墅区和睦路1号'},{c:'0106',n:'(湖墅南路) 西湖湖墅支行',a:'杭州市拱墅区湖墅南路109号'},{c:'0101',n:'(湖墅南路) 之江支行营业中心',a:'拱墅区湖墅南路418号'},{c:'0113',n:'(金华路) 之江城北支行',a:'拱墅区金华路52-56号'},{c:'0111',n:'(莫干山路) 之江美都广场支行',a:'杭州市拱墅区莫干山路789号（新）'},{c:'0110',n:'(萍水路) 浙大益乐支行',a:'杭州市拱墅区万家花城12幢'},{c:'0104',n:'(上塘路) 之江海外海支行',a:'杭州市拱墅区上塘路459号（新）'},{c:'0176',n:'(石祥路) 半山石祥路支行',a:'拱墅区石祥路342号（运河钢材市场内）'},{c:'0107',n:'(石祥路) 浙大汽车城支行',a:'杭州市拱墅区石祥路589号汽车城一楼'},{c:'0115',n:'(香积寺路) 之江三塘支行',a:'杭州市拱墅区香积寺路40号'}]},{d:'建德市',c:[{c:'0703',n:'(更楼街道) 建德更楼支行',a:'杭州市建德市更楼街道喜洋洋万嘉广场8-10'},{c:'0705',n:'(乾潭镇) 建德乾潭支行',a:'杭州市建德市乾潭镇万乐路9号'},{c:'0704',n:'(寿昌镇) 建德寿昌支行',a:'杭州市建德市寿昌镇东昌北路1号'},{c:'0706',n:'(西门街) 建德梅城支行',a:'杭州市建德市梅城镇西门街58号'},{c:'0709',n:'(新安东路) 建德新安支行',a:'杭州市建德市新安江街道新安东路55-5'},{c:'0707',n:'(新安路) 建德千岛支行',a:'杭州市建德市新安江街道新安路225号'},{c:'0713',n:'(新安路) 建德新城支行',a:'杭州市建德市新安江街道新安路103号'},{c:'0702',n:'(严东关路) 建德支行营业中心',a:'建德市新安江街道严东关路37号'}]},{d:'江干区',c:[{c:'0331',n:'(下沙) 下沙支行营业中心',a:'江干区下沙3号路'},{c:'0336',n:'(下沙) 下沙科技园支行',a:'江干区下沙6号大街19号路口新加坡科技园'},{c:'0062',n:'(采荷路) 解放路芙蓉支行',a:'杭州市江干区采荷路21号'},{c:'0335',n:'(德胜东路) 九堡德胜东路支行',a:'杭州市江干区德胜东路3678号'},{c:'0169',n:'(德胜东路) 九堡月雅路支行',a:'杭州市江干区德胜东路2666号'},{c:'0152',n:'(凤起东路) 城东南肖埠支行',a:'杭州市江干区凤起东路49号'},{c:'0153',n:'(艮山西路) 城东新城机场路支行',a:'杭州市江干区艮山西路222号'},{c:'0159',n:'(杭海路) 解放路杭海支行',a:'杭州市江干区杭海路96号'},{c:'0333',n:'(杭海路) 九堡支行营业中心',a:'江干区杭海路878号'},{c:'0123',n:'(蕙兰雅路) 半山丁桥支行',a:'杭州市江干区丁桥镇蕙兰雅路701号'},{c:'0163',n:'(机场里里街) 城东新城文晖支行',a:'杭州市江干区机场里里街53号'},{c:'0190',n:'(机场路) 城东新城笕桥支行',a:'杭州市江干区机场路248号'},{c:'0071',n:'(金堡街) 九堡九沙支行',a:'杭州市江干区金堡街107号'},{c:'0332',n:'(明月桥路) 九堡朝阳支行',a:'江干区明月桥路4号'},{c:'0170',n:'(钱潮路) 城东钱潮路支行',a:'杭州市江干区钱潮路63号'},{c:'0259',n:'(钱江路) 解放路钱江新城支行',a:'杭州市江干区钱江路639号'},{c:'0254',n:'(清江路) 解放路清泰门支行',a:'杭州市江干区清江路95号'},{c:'0056',n:'(庆春东路) 城东庆春支行',a:'杭州市江干区庆春东路66号'},{c:'0179',n:'(秋涛北路) 城东东站支行',a:'江干区秋涛北路170号'},{c:'0160',n:'(秋涛北路) 城东秋涛路支行',a:'杭州市江干区秋涛北路38-42号'},{c:'0166',n:'(秋涛北路) 城东新城三里亭支行',a:'杭州市江干区秋涛北路326号'},{c:'0173',n:'(石桥路) 城东新城农科院支行',a:'杭州市石桥路198号'},{c:'0261',n:'(市民街) 解放路市民街支行',a:'杭州市江干区市民街196号'},{c:'0177',n:'(太平门直街) 城东新塘路支行',a:'江干区太平门直街483号'},{c:'0337',n:'(天城东路) 下沙金沙湖支行',a:'杭州市经济技术开发区天城东路177号杭州东沙商业中心'},{c:'0165',n:'(天城路) 城东新城天城路支行',a:'杭州市江干区天城路87号'},{c:'0154',n:'(新风路) 城东新城支行营业中心',a:'江干区新风路396号'},{c:'0161',n:'(新塘路) 城东景苑支行',a:'杭州市江干区新塘路240号'},{c:'0260',n:'(新塘路) 解放路新杭支行',a:'杭州市江干区新塘路3号'},{c:'0334',n:'(学林街) 下沙钱塘支行',a:'江干区下沙学林街1258号'}]},{d:'临安市',c:[{c:'0556',n:'(昌化镇) 临安昌化支行',a:'杭州市临安市昌化镇东街170号'},{c:'0552',n:'(钱王街) 临安城中支行',a:'杭州市临安市锦城街道钱王街425号'},{c:'0563',n:'(钱王街) 临安玲珑支行',a:'杭州市临安市锦城街道钱王街1288号'},{c:'0551',n:'(钱王街) 临安支行营业中心',a:'临安市锦城街道钱王街960号'},{c:'0554',n:'(青山湖街道) 临安青山支行',a:'杭州市临安市青山湖街道青中街107号'},{c:'0553',n:'(天目路) 临安钱王支行',a:'杭州市临安市锦城街道天目路376号'},{c:'0559',n:'(衣锦街) 临安会锦支行',a:'杭州市临安市锦城街道衣锦街558号'},{c:'0555',n:'(於潜镇) 临安於潜支行',a:'杭州市临安市於潜镇潜洲街159号'}]},{d:'上城区',c:[{c:'0251',n:'(建国中路) 解放路支行营业中心',a:'上城区建国中路11号'},{c:'0053',n:'(雄镇楼) 中山江干支行',a:'杭州市上城区江城路299号'},{c:'0252',n:'(解放路) 中山官巷口支行',a:'杭州市上城区解放路187号'},{c:'0063',n:'(钱江路) 中山复兴支行',a:'杭州市上城区钱江路47-57号'},{c:'0057',n:'(秋涛路) 中山望江支行',a:'上城区秋涛路264-2号'},{c:'0061',n:'(望江门) 中山江城路支行',a:'杭州市上城区望江路73-77号'},{c:'0064',n:'(文华苑) 解放路钱江分理处',a:'杭州市上城区文华苑3幢底13-14号'},{c:'0072',n:'(闻潮路) 中山闻潮路支行',a:'杭州市上城区闻潮路78号'},{c:'0051',n:'(西湖大道) 中山支行营业中心',a:'上城区西湖大道35号'},{c:'0363',n:'(学士路) 延安路湖滨支行',a:'杭州市上城区学士路32号'},{c:'0058',n:'(延安路) 中山吴山支行',a:'杭州市上城区延安路37-1号'},{c:'0003',n:'(邮电路) 延安路延庆支行',a:'杭州市上城区邮电路23号'},{c:'0055',n:'(中山中路) 延安路浣纱支行',a:'杭州市上城区中山中路509号'}]},{d:'桐庐县',c:[{c:'0663',n:'(分水镇) 桐庐东关支行',a:'杭州市桐庐县分水镇九龙路41号'},{c:'0653',n:'(分水镇) 桐庐分水分理处',a:'杭州市桐庐县分水镇县前街51号'},{c:'0662',n:'(横村镇) 桐庐横村支行',a:'杭州市桐庐县横村镇锦华路360号'},{c:'0661',n:'(江南镇) 桐庐窄溪支行',a:'杭州市桐庐县江南镇窄溪大元路172号'},{c:'0657',n:'(学圣路) 桐庐城南支行',a:'杭州市桐庐县城学圣路337、341、349、353号'},{c:'0658',n:'(迎春路) 桐庐春江支行',a:'桐庐县桐君街道迎春路35号'},{c:'0654',n:'(迎春南路) 桐庐城西开发区分理处',a:'杭州市桐庐镇迎春南路梧桐公寓'},{c:'0651',n:'(迎春南路) 桐庐支行营业中心',a:'桐庐县城南街道迎春南路200号'}]},{d:'西湖区',c:[{c:'0011',n:'(朝晖路) 西湖嘉汇支行',a:'杭州市西湖区朝晖路187号'},{c:'0118',n:'(登云路) 之江文化商城支行',a:'杭州市西湖区登云路637号'},{c:'0211',n:'(古翠路) 城西古翠支行',a:'杭州市西湖区古墩路77号浙商财富中心4号楼'},{c:'0424',n:'(古墩路) 城西古墩路支行',a:'杭州市西湖区古墩路338号'},{c:'0210',n:'(三墩镇) 浙大星洲支行',a:'杭州市西湖区三墩镇厚仁路296号'},{c:'0017',n:'(教工路) 保俶文教支行',a:'杭州市西湖区教工路88号'},{c:'0067',n:'(景御路) 城东三堡支行',a:'杭州市江干区景御路173号'},{c:'0012',n:'(莲花街) 保俶莲花支行',a:'杭州市西湖区莲花街31号'},{c:'0202',n:'(留下街) 城西留下支行',a:'西湖区留下街126号'},{c:'0016',n:'(莫干山路) 西湖莫干山路支行',a:'杭州市西湖区莫干山路210号'},{c:'0108',n:'(三墩路) 浙大三墩支行',a:'杭州市西湖区三墩路140号'},{c:'0116',n:'(申花路) 浙大西城支行',a:'杭州市西湖区申花路416号'},{c:'0425',n:'(申花路) 浙大支行营业中心',a:'西湖区申花路743号剑桥公社F座'},{c:'0221',n:'(双浦镇) 上泗双浦支行',a:'杭州市西湖区双浦镇袁浦街10号农行'},{c:'0001',n:'(体育场路) 西湖支行营业中心',a:'杭州市西湖区体育场路454号'},{c:'0212',n:'(文二路) 保俶教工路支行',a:'西湖区文二路202号'},{c:'0007',n:'(文二路) 城西文新路支行',a:'杭州市西湖区文二西路119号'},{c:'0201',n:'(文二路) 城西支行营业中心',a:'杭州市西湖区文二路391号'},{c:'0364',n:'(文三路) 城西科技城支行',a:'杭州市西湖区文三路477号（华星科技大厦一楼'},{c:'0004',n:'(文三路) 西湖文三路支行',a:'杭州市西湖区文三路121号'},{c:'0008',n:'(文三西路) 城西古荡支行',a:'杭州市西湖区文三西路118号杭州电子商务大厦一层'},{c:'0204',n:'(文三西路) 城西杭三路支行',a:'西湖区文三西路283号'},{c:'0205',n:'(文一西路) 城西竞舟支行',a:'杭州市西湖区文一西路98号数娱大厦1层'},{c:'0531',n:'(文一西路) 西溪支行营业中心',a:'西湖区文一西路1500号'},{c:'0426',n:'(文一西路) 浙大文华支行',a:'杭州市西湖区文一西路199号'},{c:'0014',n:'(学院路) 保俶枫华支行',a:'杭州市西湖区学院路121号农行'},{c:'0009',n:'(学院路) 保俶学院路支行',a:'杭州市西湖区学院路268号'},{c:'0422',n:'(余杭塘路) 浙大紫金港分理处',a:'余杭区余杭塘路388号白沙综合楼1楼'},{c:'0013',n:'(玉古路) 保俶黄龙支行',a:'杭州市西湖区玉古路173号中田大厦1楼'},{c:'0421',n:'(浙大路) 保俶玉泉支行',a:'杭州市西湖区浙大路39号'},{c:'0203',n:'(转塘镇) 上泗支行营业中心',a:'西湖区转塘镇江口218号'},{c:'0207',n:'(转塘直街) 上泗转塘支行',a:'杭州市西湖区转塘直街19号'},{c:'0213',n:'(紫荆花路) 城西紫荆花路支行',a:'杭州市西湖区紫荆花路2号联合大厦一楼'},{c:'0301',n:'(曙光路) 保俶支行营业中心',a:'西湖区曙光路122号世贸君澜大饭店一楼'}]},{d:'下城区',c:[{c:'0151',n:'(凤起路) 城东支行营业中心',a:'下城区凤起路74号'},{c:'0005',n:'(凤起路) 延安路十五家园支行',a:'杭州市下城区凤起路182号'},{c:'0157',n:'(和平农展馆) 城东新城物资城支行',a:'下城区和平农展馆一楼'},{c:'0156',n:'(河东路) 西湖朝晖支行',a:'下城区河东路87号'},{c:'0128',n:'(华丰路) 半山华丰路支行',a:'杭州市下城区华丰路192号'},{c:'0178',n:'(环城北路) 城东艮山支行',a:'杭州市下城区环城北路65号'},{c:'0006',n:'(环城北路) 西湖杭州大厦支行',a:'杭州市下城区环城北路220号杭州大厦C座一楼'},{c:'0054',n:'(庆春路) 延安路下城支行',a:'杭州市下城区庆春路152号'},{c:'0482',n:'(庆春路) 营业部营业中心',a:'杭州市下城区庆春路28号'},{c:'0171',n:'(石桥路) 城东新城石大路支行',a:'杭州市下城区石桥路245-2号'},{c:'0155',n:'(体育场路) 延安路和平支行',a:'下城区体育场路107号'},{c:'0018',n:'(西湖文化广场) 西湖文化广场支行',a:'杭州市西湖文化广场16号（环球中心北一楼）'},{c:'0361',n:'(延安路) 延安路支行营业中心',a:'下城区延安路521号'},{c:'0258',n:'(长庆街) 解放路金汇支行',a:'下城区长庆街55号'},{c:'0066',n:'(中山北路) 延安路中北支行',a:'杭州市下城区中山北路308号'}]},{d:'余杭区',c:[{c:'0505',n:'(崇贤镇) 余杭崇贤支行',a:'杭州市余杭区崇贤镇府新街168号'},{c:'0532',n:'(道望梅路) 余杭临平商贸城支行',a:'杭州市余杭区道望梅路586号'},{c:'0580',n:'(翡翠天地) 西溪翡翠城支行',a:'杭州市余杭区五常街道翡翠天地商苑2幢2-1-2号'},{c:'0509',n:'(勾庄路) 良渚支行营业中心',a:'余杭区良渚街道勾庄路53号'},{c:'0523',n:'(金恒路) 良渚金恒路支行',a:'杭州市余杭区良渚街道金恒路88号25幢25-1，25-2号'},{c:'0530',n:'(南大街) 余杭南苑支行',a:'杭州市余杭区南大街314-324号'},{c:'0502',n:'(藕花洲大街) 余杭临平支行',a:'杭州市余杭区藕花洲大街326号'},{c:'0506',n:'(瓶窑镇) 良渚瓶窑支行',a:'杭州市余杭区瓶窑镇东兴路50号'},{c:'0518',n:'(乔司监狱) 余杭乔司农场储蓄所',a:'杭州市余杭区乔司监狱商贸中心'},{c:'0503',n:'(乔司镇) 余杭乔司支行',a:'杭州市余杭区乔司镇乔莫东路49号'},{c:'0501',n:'(邱山大街) 余杭支行营业中心',a:'余杭区邱山大街500号'},{c:'0510',n:'(仁和镇) 余杭仁和支行',a:'杭州市余杭区仁和镇和平路57号'},{c:'0504',n:'(塘栖镇) 余杭塘栖支行',a:'杭州市余杭区塘栖镇广济路334-339号'},{c:'0529',n:'(逸盛路) 良渚物流中心支行',a:'杭州市余杭区良渚街道逸盛路133、135、137号'},{c:'0507',n:'(禹航路) 西溪大禹支行',a:'杭州市余杭区余杭街道禹航路425号'},{c:'0508',n:'(玉琮路) 良渚玉琮路支行',a:'杭州市余杭区良渚街道玉琮路30号'}]}];

	var districts = [];

  for(var i = 0; i < nets.length; i++) {
    districts.push(nets[i].d);
	}

	var billTypes = [
		'电子账单','纸质账单-寄送到家庭地址','纸质账单-寄送到单位地址'
	];

	return {
		allNets: function() {
			return nets;
		},
		allDistricts: function() {
			return districts;
		},
		allBillTypes: function() {
			return billTypes;
		}
	};
})

.service('$storage', function($window) {
  // Might use a resource here that returns a JSON array

  var localStorage = 'localStorage';

  var sessionStorage = 'sessionStorage';

  var defaultStorage = sessionStorage;

  var storage = defaultStorage === localStorage ? $window.localStorage : $window.sessionStorage;

  return {
    getLength: function(){
      return storage.length;
    },
    getDate: function(){
      var json = [];
      $.each(storage, function(i, v){
        json.push(angular.fromJson(v));
      });
      return json;
    },
    addItem: function(id, value) {
      if(typeof value !== 'undefined' && value !== null) {
        var json = JSON.stringify(value);
        storage.setItem(id, json);
      }
    },
    getItem: function(id){
      var value = storage.getItem(id);
      var json;
      if(typeof value !== 'undefined' && value !== null) {
        json = angular.fromJson(value);
      }
      return json;
    },
    removeItem: function(id){
      var value = storage.getItem(id);
      var json;
      if(typeof value !== 'undefined' && value !== null) {
        json = angular.fromJson(value);
      }
      if(typeof json !== 'undefined')
        storage.removeItem(id);
    }
  };

});

